Tekla Open API Reference for Tekla Structures 2025
CrossSection.OuterSurface Property
 Gets the cross section points for outer surface.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<CrossSectionPoint> OuterSurface { get; }
Public ReadOnly Property OuterSurface As List(Of CrossSectionPoint)
	Get
Property Value
Type: List<CrossSectionPoint>
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace